//Создать пустой проект в IntelliJ IDEA и прописать метод main().
//        Создать переменные всех пройденных типов данных и инициализировать их значения.
//        Написать метод вычисляющий выражение a * (b + (c / d)) и возвращающий результат,
//        где a, b, c, d – аргументы этого метода, имеющие тип float.
//        Написать метод, принимающий на вход два целых числа и проверяющий, что их сумма лежит в пределах от 10 до 20 (включительно), если да – вернуть true, в противном случае – false.
//        Написать метод, которому в качестве параметра передается целое число, метод должен напечатать в консоль, положительное ли число передали или отрицательное. Замечание: ноль считаем положительным числом.
//        Написать метод, которому в качестве параметра передается целое число. Метод должен вернуть true, если число отрицательное.
//        Написать метод, которому в качестве параметра передается строка, обозначающая имя. Метод должен вывести в консоль сообщение «Привет, указанное_имя!».
//        *Написать метод, который определяет, является ли год високосным, и выводит сообщение в консоль. Каждый 4-й год является високосным, кроме каждого 100-го, при этом каждый 400-й – високосный.


package com.company;

import org.w3c.dom.ls.LSOutput;

public class Main {

    public static void main(String[] args) {
        // //---------------Создать переменные всех пройденных типов данных и инициализировать их значения.
//        byte b;
//        b = 120;
//        short s;
//        s = 30200;
//        int a;
//        a = 10;
//        long l;
//        l = 87321875984315l;
//        float f;
//        f = 10.02f;
//        double d;
//        d = 213.123;
//        char c = 43;//'+'
//        boolean bool;
//        bool = true;
//        bool = false;
        //-----------------------------Написать метод вычисляющий выражение a * (b + (c / d)) и возвращающий результат,
//        где a, b, c, d – аргументы этого метода, имеющие тип float.


//        equation(12.22f,13.33f,14.44f,15.55f);
//
//
//    public static float equation(float a, float b, float c, float d){
//        return a * (b + (c / d));
//    }
        //--------------------------------Написать метод, принимающий на вход два целых числа и проверяющий, что их сумма лежит в пределах от 10 до 20 (включительно), если да – вернуть true, в противном случае – false.

//
//        public static boolean sum(int a, int b){
//        if(a + b <= 20||a + b >=10){
//            return true;
//        } else {
//            return false;
//        }
//    }
//      ------------------------------Написать метод, которому в качестве параметра передается целое число, метод должен напечатать в консоль, положительное ли число передали или отрицательное. Замечание: ноль считаем положительным числом.
//        public static void number(int a) {
//            if(a>=0){
//                System.out.println("Это положительное число");
//            }else{
//                System.out.println("Это отрицательное число");
//            }
//        }
//------------------------Написать метод, которому в качестве параметра передается целое число. Метод должен вернуть true, если число отрицательное.
//        public static boolean number(int a){
//            if(a<=0){
//                return true;
//            }else{
//                return false;
//            }
//        }
//------------------------Написать метод, которому в качестве параметра передается строка, обозначающая имя. Метод должен вывести в консоль сообщение «Привет, указанное_имя!».
//
//        public static void str(String a){
//            System.out.println("Привет, "+ a+"!");
//        }
//--------------------------*Написать метод, который определяет, является ли год високосным, и выводит сообщение в консоль. Каждый 4-й год является високосным, кроме каждого 100-го, при этом каждый 400-й – високосный.
//
//
//    yearType(444000);
//    }
//
//    public static void yearType(int year){
//        if (year%4!=0&year%400!=0&year%100==0){
//            System.out.println("Год не високосный!");
//        }else {
//            System.out.println("Год високосный!");
//        }
//    }


}
